<h2>Написание cms на базе kohana 3.2</h2>
<p>Здравствуйте ,открываю новый цикл статей посвященных написанию CMS на фреймворке kohana версии 3.2.</p>
<p>Под словами &#171;написание cms&#187; &#8212; я понимаю написание базовой основы ,отталкиваясь от которой можно будет написать свой функционал который вам потребуется.</p>
<p>Примерный функционал:<br />
1. Регистрация / Авторизация<br />
2. Админ-панель<br />
3. Создание статичных страниц<br />
4. Управление ролями ,привилегиями<br />
5. Модуль гостевой книги</p>
<p>В ходе изучения мы также изучим анатомию фреймворка ,его базовый функционал и возможности.</p>
<p>Зачем нужен подобный цикл? Для многих первоначальное знакомство с фреймворками вводит в ступор. Многие банально не знают с чего начать написание кода. В свое время я также сталкивался с подобными проблемами.<br />
Для меня же это тоже хороший опыт +самоцель написание полноценной cms.</p>
<p>Жду от вас комментариев ).<br />
Начнемс</p>